![imagen](./img/sql_murder.png)

# Ejercicio SQL Murder
Para este ejercicio vas a ponerte la gabardina y el sombrero ya que tendrás que investigar un asesinato en *SQL City*. 

Aplicarás los conecptos básicos de SQL y aprenderás a manejarte con un modelo de datos, mientras resuelves un caso de asesinato :)

Este espectacular juego está creado por **Joon Park y Cathy He**, y podrás encontrar todos los detalles en [su web](http://mystery.knightlab.com)

Para realizar el ejercicio tienes dos opciones, o bien desde la propia web, donde encontrarás un intérprete de sentencias SQL interactivo. Si usas esta opción te recomiendo que vayas apuntando las queries y sus outputs. O la otra opción es [acudir a su GitHub](https://github.com/NUKnightLab/sql-mysteries), descargarte la base de datos y realizar las queries desde Jupyter. Probablemente la primera opción te sea más cómoda


### Enunciado
A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **murder** that occurred sometime on **Jan.15, 2018** and that it took place in **SQL City**. Start by retrieving the corresponding crime scene report from the police department’s database.


### Modelo de datos
![imagen](./img/sql_game_schemma.png)

¡Suerte Sherlock!

In [1]:
import pandas as pd
import sqlite3
# pd.set_option('display.max_columns', None)
# pd.set_option('display.max_rows', None)

In [2]:
# Conectamos con la base de datos chinook.db
path = 'sql-murder-mystery.db'
connection = sqlite3.connect(path)

# Obtenemos un cursor que utilizaremos para hacer las queries
curs = connection.cursor()  # el cursor se comunica con la query a traves de la base de datos y lo trae

In [3]:
pd.set_option('max_colwidth', 800)

In [4]:
query="""
SELECT *
FROM person p
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684
...,...,...,...,...,...,...
10006,99936,Luba Benser,274427,680,Carnage Blvd,685095054
10007,99941,Roxana Mckimley,975942,1613,Gate St,512136801
10008,99965,Cherie Zeimantz,287627,3661,The Water Ave,362877324
10009,99982,Allen Cruse,251350,3126,N Jean Dr,348734531
10010,99990,Vance Hunten,830407,3056,Lancefield St,896677562

In [6]:
query="""
SELECT *
FROM drivers_license dl
"""
pd.read_sql_query(query, connection)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,100280,72,57,brown,red,male,P24L4U,Acura,MDX
1,100460,63,72,brown,brown,female,XF02T6,Cadillac,SRX
2,101029,62,74,green,green,female,VKY5KR,Scion,xB
3,101198,43,54,amber,brown,female,Y5NZ08,Nissan,Rogue
4,101255,18,79,blue,grey,female,5162Z1,Lexus,GS
...,...,...,...,...,...,...,...,...,...
10002,999923,19,77,amber,black,female,5L0ZI4,GMC,Sierra 3500
10003,999940,71,61,green,green,male,1B8QN8,Mitsubishi,Eclipse
10004,999981,67,69,brown,blue,female,1684K3,Land Rover,LR2
10005,999986,49,58,green,grey,male,F8F64H,Lexus,LS
10006,999993,18,63,black,black,female,6UZO2O,Cadillac,DeVille

In [7]:
query="""
SELECT *
FROM get_fit_now_member gfnm
"""
pd.read_sql_query(query, connection)

,id,person_id,name,membership_start_date,membership_status
0,NL318,65076,Everette Koepke,20170926,gold
1,AOE21,39426,Noe Locascio,20171005,regular
2,2PN28,63823,Jeromy Heitschmidt,20180215,silver
3,0YJ24,80651,Waneta Wellard,20171206,gold
4,3A08L,32858,Mei Bianchin,20170401,silver
...,...,...,...,...,...
179,2V137,41693,Wendell Dulany,20171219,silver
180,4KB72,79110,Emile Hege,20170522,regular
181,48Z7A,28819,Joe Germuska,20160305,gold
182,48Z55,67318,Jeremy Bowers,20160101,gold
183,90081,16371,Annabel Miller,20160208,gold

In [10]:
query="""
SELECT *
FROM facebook_event_checkin fec
"""
pd.read_sql_query(query, connection)

,person_id,event_id,event_name,date
0,28508,5880,Nudists are people who wear one-button suits.\n,20170913
1,63713,3865,but that's because it's the best book on anything for the layman.\n,20171009
2,63713,3999,"If Murphy's Law can go wrong, it will.\n",20170502
3,63713,6436,Old programmers never die. They just branch to a new address.\n,20170926
4,82998,4470,Help a swallow land at Capistrano.\n,20171022
...,...,...,...,...
20006,99716,1143,SQL Symphony Concert,20171206
20007,99716,1143,SQL Symphony Concert,20171212
20008,99716,1143,SQL Symphony Concert,20171229
20009,67318,4719,The Funky Grooves Tour,20180115
20010,67318,1143,SQL Symphony Concert,20171206

In [11]:
query="""
SELECT *
FROM interview it
"""
pd.read_sql_query(query, connection)

,person_id,transcript
0,28508,‘I deny it!’ said the March Hare.\n
1,63713,\n
2,86208,"way, and the whole party swam to the shore.\n"
3,35267,"lessons in here? Why, there’s hardly room for YOU, and no room at all\n"
4,33856,\n
...,...,...
4986,37357,"Alice did not wish to offend the Dormouse again, so she began very\n"
4987,10206,"time,’ she said, ‘than waste it in asking riddles that have no answers.’\n"
4988,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
4989,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."
4990,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

In [12]:
query="""
SELECT *
FROM get_fit_now_check_in gfnci
"""
pd.read_sql_query(query, connection)

     membership_id  check_in_date  check_in_time  check_out_time
0            NL318       20180212            329             365
1            NL318       20170811            469             920
2            NL318       20180429            506             554
3            NL318       20180128            124             759
4            NL318       20171027            418            1019
...            ...            ...            ...             ...
2698         4KB72       20170422           1016            1114
2699         4KB72       20170630            408             885
2700         48Z7A       20180109           1600            1730
2701         48Z55       20180109           1530            1700
2702         90081       20180109           1600            1700

[2703 rows x 4 columns]

In [13]:
query="""
SELECT *
FROM income ic
"""
pd.read_sql_query(query, connection)

            ssn  annual_income
0     100009868          52200
1     100169584          64500
2     100300433          74400
3     100355733          35900
4     100366269          73000
...         ...            ...
7509  999679296          54400
7510  999762859          77000
7511  999824984          82000
7512  999910617          82600
7513  999942603          11500

[7514 rows x 2 columns]

In [17]:
query="""
SELECT *
FROM crime_scene_report csr
WHERE csr.type = 'murder' AND csr.city = 'SQL City' AND csr.date = '20180115'
"""
pd.read_sql_query(query, connection)

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [23]:
# Este es el primer testigo

query="""
SELECT *
FROM person
WHERE address_street_name = 'Northwestern Dr'
ORDER BY address_number desc
LIMIT 1
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [26]:
# Este es el segundo testigo

query="""
SELECT *
FROM person
WHERE name LIKE 'Annabel%' AND address_street_name = 'Franklin Ave'
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [9]:
# Entrevista al primer testigo

query="""
SELECT p.name, i.transcript
FROM person p
JOIN interview i ON p.id = i.person_id
WHERE p.id = '14887'
"""
pd.read_sql_query(query, connection)

,name,transcript
0,Morty Schapiro,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."

In [10]:
# Entravista a segundo testigo

query="""
SELECT p.name, i.transcript
FROM person p
JOIN interview i ON p.id = i.person_id
WHERE p.id = '16371'
"""
pd.read_sql_query(query, connection)

,name,transcript
0,Annabel Miller,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [37]:
# Averiguo el membership_id de Annabel Miller del gimnasio... y con eso, la hora a la que fue al gimnasio, para ver a que hora coincidio con el asesino.

query="""
SELECT gc.check_in_date, gc.check_in_time, gc.check_out_time
FROM person p
JOIN get_fit_now_member gm ON p.id = gm.person_id
JOIN get_fit_now_check_in gc ON gm.id = gc.membership_id
WHERE p.id = '16371'
"""
pd.read_sql_query(query, connection)

# Check in Annabel = 1600
# Check out Annabel = 1700

   check_in_date  check_in_time  check_out_time
0       20180109           1600            1700

In [41]:
query="""
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = '20180109'
"""
pd.read_sql_query(query, connection)

  membership_id  check_in_date  check_in_time  check_out_time
0         X0643       20180109            957            1164
1         UK1F2       20180109            344             518
2         XTE42       20180109            486            1124
3         1AE2H       20180109            461             944
4         6LSTG       20180109            399             515
5         7MWHJ       20180109            273             885
6         GE5Q8       20180109            367             959
7         48Z7A       20180109           1600            1730
8         48Z55       20180109           1530            1700
9         90081       20180109           1600            1700

In [42]:
# Los 3 con los que se cruzo Annabel en el gimnasio

query="""
SELECT *
FROM get_fit_now_check_in
WHERE (check_in_time < 1700 AND check_out_time > 1600) AND (check_in_date = '20180109')
"""
pd.read_sql_query(query, connection).head(30)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700
2         90081       20180109           1600            1700

In [46]:
query="""
SELECT *
FROM get_fit_now_check_in gfnci
JOIN get_fit_now_member gfnm ON gfnci.membership_id = gfnm.id
WHERE membership_id = '48Z7A' OR membership_id = '48Z55' OR membership_id = '90081'
"""
pd.read_sql_query(query, connection)

,membership_id,check_in_date,check_in_time,check_out_time,id,person_id,name,membership_start_date,membership_status
0,48Z55,20180109,1530,1700,48Z55,67318,Jeremy Bowers,20160101,gold
1,48Z7A,20180109,1600,1730,48Z7A,28819,Joe Germuska,20160305,gold
2,90081,20180109,1600,1700,90081,16371,Annabel Miller,20160208,gold